app/views/main/fight.slim

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
javascript:
  jQuery(document).ready(function($) {


    new_monster() // После загрузки страницы сразу запускаем функцию new_monster()

    function new_monster(){
      // Получаем из экшена Main#monster json-данные, раскидываем их по странице
      $.get( "/get_new_monster.json", function( data ) {


      // Разные переменные
      var progress = data.user.exp / (data.user.next / 100)

      // Параметры для счётчика
      var options = {useEasing : false, useGrouping : false, separator : ',', decimal : '.', prefix : '', suffix : ' hp'}


        $(".progress-bar").css("width", + progress + "%"),
        $("#name").text(data.monster.name)
        $("#monster_image").attr("src", "/images/monsters/" + data.monster.id + ".gif")
