app/views/users/show.slim

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
    // create STR variable
  $( "#str" ).parent().click(function() {
    // get monster params
    $.get( "/get_new_monster.json", function( data ) {
    // work with stats points.  if point !=0, then add
      if ($("#stats").text() != 0){
        $("#str").text(data.user.str + 1),
        // remove 1 general point
        $("#stats").text(data.user.statpoint - 1),
        $.post("/stats", {str: 1})
        }
    })
  })