app/controllers/main_controller.rb

    def monster
      # find in Map model   user, location and monsters
      @monster = Map.find_by_name(current_user.location).monsters.sample
---
SELECT  `maps`.* FROM `maps`  WHERE `maps`.`name` = 'new_zone03' LIMIT 1