app/controllers/users_controller.rb

  def exp

    item = Item.find(Monster.find(params[:monster_id]).equip_drop) # looking items in monster

    Box.chance(params[:monster_id], user, item) # HZ sho eto za nah

    exp_for_lvl = [0, 660, 1080, 1800, 2640, 3840, 4560, 5040, 5460, 6000, 6600, 7200, 7320, 7620, 8040, 8820, 9600, 10080, 10560, 11040] # array with exp ponts per lvl
    render nothing: true # ????????????
    user.update(exp: user.exp + params[:exp].to_i) # update user params and make in integer
    if user.exp > user.next  # if user EXP more then 100% per lvl  add points
      user.update(next: exp_for_lvl[user.lvl + 1], statpoint: user.statpoint + 1, lvl: user.lvl + 1) # update user params if LVL UP (work with counts. add +1 lvl and + 1 free point)
---
SELECT  `items`.* FROM `items`  WHERE `items`.`id` = 2 LIMIT 1
SELECT  `monsters`.* FROM `monsters`  WHERE `monsters`.`id` = 2 LIMIT 1
UPDATE `users` SET `exp` = 1834, `updated_at` = '2015-01-06 13:46:52' WHERE `users`.`id` = 1
UPDATE `users` SET `lvl` = 4, `next` = 2640, `statpoint` = 3, `updated_at` = '2015-01-06 13:46:52' WHERE `users`.`id` = 1

  def stats
    render nothing: true
    if user.statpoint > 0
      if params[:str]
        user.update(str: user.str + 1, statpoint: user.statpoint - 1) # loop with points. if add 1 point in STR or LUX , then remove 1 point in general counter
---
UPDATE `users` SET `statpoint` = 23, `str` = 2, `updated_at` = '2015-01-06 13:03:47' WHERE `users`.`id` = 1